app/controllers/appointments_controller.rb

  def create
    Time.zone = appointment_params[:time_zone]
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("name", "phone_number", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "rice"], ["phone_number", "3128849493"], ["time", "2020-04-16 10:45:00"], ["created_at", "2020-04-16 19:28:40.220054"], ["updated_at", "2020-04-16 19:28:40.220054"]]

  def update
    respond_to do |format|
      if @appointment.update(appointment_params)
---
UPDATE "appointments" SET "name" = ?, "time" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["name", "nom nom"], ["time", "2020-04-18 20:15:00"], ["updated_at", "2020-04-19 01:10:47.833183"], ["id", 13]]